MazenFayed/Multi-Tasking-Management-using-RTOS-in-OBC-of-the-CubeSat-/drivers/inc/stm32f446xx_driver.h
/*

 * stm32f446xx_driver.h

 *
 *  Created on: Dec 30, 2020
 *      Author: Cubesat58
 *  Developed on : feb 8 ,2022
 *      Developer: MAZEN FAYED
 */

#ifndef INC_STM32F446XX_DRIVER_H_
#define INC_STM32F446XX_DRIVER_H_
#include <stdint.h>     // library for definitios of unit16,32 and so on
#include <stddef.h>
#define __vo volatile
#define __weak __attribute__((weak))   // that macro means that if you use this macro before any function then user can override this function


/**********************************START:Processor Specific Details **********************************/

/* GPIO_Pin_sources
  *
  */
#define GPIO_PinSource0            ((uint8_t)0x00)
#define GPIO_PinSource1            ((uint8_t)0x01)
#define GPIO_PinSource2            ((uint8_t)0x02)
#define GPIO_PinSource3            ((uint8_t)0x03)
#define GPIO_PinSource4            ((uint8_t)0x04)
#define GPIO_PinSource5            ((uint8_t)0x05)
#define GPIO_PinSource6            ((uint8_t)0x06)
#define GPIO_PinSource7            ((uint8_t)0x07)
#define GPIO_PinSource8            ((uint8_t)0x08)
#define GPIO_PinSource9            ((uint8_t)0x09)
#define GPIO_PinSource10           ((uint8_t)0x0A)
#define GPIO_PinSource11           ((uint8_t)0x0B)
#define GPIO_PinSource12           ((uint8_t)0x0C)
#define GPIO_PinSource13           ((uint8_t)0x0D)
#define GPIO_PinSource14           ((uint8_t)0x0E)
#define GPIO_PinSource15           ((uint8_t)0x0F)

/**
  * AF  selection
  */
#define AF0        ((uint8_t)0x00)  /* Alternate Function 0 mapping */
#define AF1        ((uint8_t)0x01)  /* Alternate Function 0 mapping */
#define AF2        ((uint8_t)0x02)  /* Alternate Function 0 mapping */
#define AF3        ((uint8_t)0x03)  /* Alternate Function 0 mapping */
#define AF4        ((uint8_t)0x04)  /* Alternate Function 0 mapping */
#define AF5        ((uint8_t)0x05)  /* Alternate Function 0 mapping */
#define AF6        ((uint8_t)0x06)  /* Alternate Function 0 mapping */
#define AF7        ((uint8_t)0x07)  /* Alternate Function 0 mapping */
#define AF8        ((uint8_t)0x08)  /* Alternate Function 0 mapping */
#define AF9        ((uint8_t)0x09)  /* Alternate Function 0 mapping */
#define AF10        ((uint8_t)0x0A)  /* Alternate Function 0 mapping */
#define AF11       ((uint8_t)0x0B)  /* Alternate Function 0 mapping */
#define AF12       ((uint8_t)0x0C)  /* Alternate Function 0 mapping */
#define AF13       ((uint8_t)0x0D)  /* Alternate Function 0 mapping */
#define AF14       ((uint8_t)0x0E)  /* Alternate Function 0 mapping */
#define AF15       ((uint8_t)0x0F)  /* Alternate Function 0 mapping */


/*
 * ARM Cortex Mx Processor NVIC ISERx register Addresses interrupt set register
 */

#define NVIC_ISER0   			        ( (__vo uint32_t*)0xE000E100 )
#define NVIC_ISER1          			( (__vo uint32_t*)0xE000E104 )
#define NVIC_ISER2        				( (__vo uint32_t*)0xE000E108 )
#define NVIC_ISER3          			( (__vo uint32_t*)0xE000E10c )


/*
 * ARM Cortex Mx Processor NVIC ICERx register Addresses  interrupt clear register
 */
#define NVIC_ICER0 						((__vo uint32_t*)0XE000E180)
#define NVIC_ICER1						((__vo uint32_t*)0XE000E184)
#define NVIC_ICER2  					((__vo uint32_t*)0XE000E188)
#define NVIC_ICER3						((__vo uint32_t*)0XE000E18C)


/*
 * ARM Cortex Mx Processor Priority Register Address Calculation
 */
#define NVIC_PR_BASE_ADDR 				((__vo uint32_t*)0xE000E400)

/*
 * ARM Cortex Mx Processor number of priority bits implemented in Priority Register  in ST  may be 3 in TI
 */
#define NO_PR_BITS_IMPLEMENTED  4



#define DWT_BASE            (0xE0001000UL)                            /*!< DWT Base Address                   */


/*
 * define base addresses for peripherals
 */
#define FLASH_BASEADDR 					0x08000000U  // Main memory
#define SRAM1_BASEADDR					0x20000000U
#define SRAM2_BASEADDR					0x2001C000U   //this is calculated by adding 112Kb to SRAM1_BASADDR
#define SRAM 							SRAM1_BASEADDR
#define ROM_BASEADDR					0x1FFF0000U  //System memeory

/*
 * AHBx & APBx Bus peripherals base addresses
 */
#define PERIPH_BASE						0x40000000U
#define APB1_BASEADDR 					PERIPH_BASE
#define APB2_BASEADDR					0x40010000U
#define AHB1_BASEADDR					0x40020000U
#define AHB2_BASEADDR					0x50000000U
#define AHB3_BASEADDR					0xA0001000U
/*
 * define base addresses of peripherals hanging on AHB1 BUS
 */
#define GPIOA_BASEADDR 					(AHB1_BASEADDR+0x0000)
#define GPIOB_BASEADDR					(AHB1_BASEADDR+0x0400)
#define GPIOC_BASEADDR					(AHB1_BASEADDR+0x0800)
#define GPIOD_BASEADDR					(AHB1_BASEADDR+0x0C00)
#define GPIOE_BASEADDR					(AHB1_BASEADDR+0x1000)
#define GPIOF_BASEADDR					(AHB1_BASEADDR+0x1400)
#define GPIOG_BASEADDR					(AHB1_BASEADDR+0x1800)
#define GPIOH_BASEADDR					(AHB1_BASEADDR+0x1C00)
#define CRC_BASEADDR					(AHB1_BASEADDR+0x3000)
#define RCC_BASEADDR					(AHB1_BASEADDR+0x3800)
#define FLASH_INTERFACE_BASEADDR 		(AHB1_BASEADDR+0x3C00)
#define BKPSRAM_BASEADDR				(AHB1_BASEADDR+0x4000)
#define DMA1_BASEADDR					(AHB1_BASEADDR+0x6000)
#define DMA2_BASEADDR					(AHB1_BASEADDR+0x6400)
#define USB_OTG_HS_BASEADDR				(AHB1_BASEADDR+0x0000)

/*
 * define base addresses of peripherals hanging on AHB2 BUS
 */
#define USB_OTG_FS_BASEADDR				(AHB2_BASEADDR+0x0000)
#define DCMI_BASEADDR					(AHB2_BASEADDR+0x0000)

/*
 * define base addresses of peripherals hanging on AHB3 BUS
 */
#define QUADSPI_register_BASEADDR		(AHB3_BASEADDR+0x1000)
#define FMC_control_register_BASEADDR	(AHB3_BASEADDR+0x0000)

/*
 * define base addresses of peripherals hanging on APB1 BUS
 */
#define TIM2_BASEADDR					(APB1_BASEADDR+0x0000)
#define TIM3_BASEADDR					(APB1_BASEADDR+0x4000)
#define TIM4_BASEADDR   				(APB1_BASEADDR+0x8000)
#define TIM5_BASEADDR  					(APB1_BASEADDR+0xC000)
#define TIM6_BASEADDR   				(APB1_BASEADDR+0x1000)
#define TIM7_BASEADDR   				(APB1_BASEADDR+0x1400)
#define TIM12_BASEADDR   				(APB1_BASEADDR+0x1800)
#define TIM13_BASEADDR   				(APB1_BASEADDR+0x1C00)
#define TIM14_BASEADDR  				(APB1_BASEADDR+0x2000)

#define RTC_BKP_Register_BASEADDR 		(APB1_BASEADDR+0x2800)
#define WWDG_BASEADDR 					(APB1_BASEADDR+0x2C00)
#define IWDG_BASEADDR 					(APB1_BASEADDR+0x3000)

#define SPI2_BASEADDR					(APB1_BASEADDR+0x3800)
#define SPI3_BASEADDR					(APB1_BASEADDR+0x3C00)

#define SPDIF_RX_BASEADDR				(APB1_BASEADDR+0x4000)

#define USART2_BASEADDR					(APB1_BASEADDR+0x4400)
#define USART3_BASEADDR					(APB1_BASEADDR+0x4800)
#define UART4_BASEADDR					(APB1_BASEADDR+0x4C00)
#define UART5_BASEADDR					(APB1_BASEADDR+0x5000)

#define I2C1_BASEADDR					(APB1_BASEADDR+0x5400)
#define I2C2_BASEADDR					(APB1_BASEADDR+0x5800)
#define I2C3_BASEADDR					(APB1_BASEADDR+0x5C00)

#define CAN1_BASEADDR					(APB1_BASEADDR+0x6400)
#define CAN2_BASEADDR					(APB1_BASEADDR+0x6800)
#define HDMI_CEC_BASEADDR				(APB1_BASEADDR+0x6C00)
#define PWR_BASEADDR					(APB1_BASEADDR+0x7000)
#define DAC_BASEADDR					(APB1_BASEADDR+0x7400)



