MazenFayed/Multi-Tasking-Management-using-RTOS-in-OBC-of-the-CubeSat-/drivers/inc/stm32f446xx_driver.h
/*
 * define base addresses of peripherals hanging on APB2 BUS
 */
#define TIM1_BASEADDR					(APB2_BASEADDR+0x0000)
#define TIM8_BASEADDR					(APB2_BASEADDR+0x0400)

#define USART1_BASEADDR					(APB2_BASEADDR+0x1000)
#define USART6_BASEADDR					(APB2_BASEADDR+0x1400)

#define ADC_BASEADDR					 (APB2_BASEADDR+0x2000) // ADC1 ,ADC2 ADC3  SYSCFG
#define ADC1_BASEADDR                    (ADC_BASEADDR+0x000)
#define ADC2_BASEADDR                    (ADC_BASEADDR+0x100)
#define ADC3_BASEADDR                    (ADC_BASEADDR+0x200)
#define ADC_CR_BASEADDR                  (ADC_BASEADDR+0x300)


#define SDMMC_BASEADDR					(APB2_BASEADDR+0x2C00)

#define SPI1_BASEADDR					(APB2_BASEADDR+0x3000)
#define SPI4_BASEADDR					(APB2_BASEADDR+0x3400)
#define SYSCFG_BASEADDR					(APB2_BASEADDR+0x3800)

#define EXTI_BASEADDR					(APB2_BASEADDR+0x3C00)
#define TIM9_BASEADDR					(APB2_BASEADDR+0x4000)
#define TIM10_BASEADDR					(APB2_BASEADDR+0x4400)
#define TIM11_BASEADDR					(APB2_BASEADDR+0x4800)

#define SAI1_BASEADDR					(APB2_BASEADDR+0x5800)
#define SAI2_BASEADDR					(APB2_BASEADDR+0x5C00)


/**********************************peripheral register definition structures **********************************/

/*
 * Note : Registers of a peripheral are specific to MCU
 * e.g : Number of Registers of SPI peripheral of STM32F4x family of MCUs may be different(more or less)
 * Compared to number of registers of SPI peripheral of STM32Lx or STM32F0x family of MCUs
 * Please check your Device RM
 */

/** \brief  Structure type to access the Data Watchpoint and Trace Register (DWT).
 */
typedef struct
{
	__vo uint32_t CTRL;                    /*!< Offset: 0x000 (R/W)  Control Register                          */
	__vo uint32_t CYCCNT;                  /*!< Offset: 0x004 (R/W)  Cycle Count Register                      */
	__vo uint32_t CPICNT;                  /*!< Offset: 0x008 (R/W)  CPI Count Register                        */
	__vo uint32_t EXCCNT;                  /*!< Offset: 0x00C (R/W)  Exception Overhead Count Register         */
	__vo uint32_t SLEEPCNT;                /*!< Offset: 0x010 (R/W)  Sleep Count Register                      */
	__vo uint32_t LSUCNT;                  /*!< Offset: 0x014 (R/W)  LSU Count Register                        */
	__vo uint32_t FOLDCNT;                 /*!< Offset: 0x018 (R/W)  Folded-instruction Count Register         */
	__vo  uint32_t PCSR;                    /*!< Offset: 0x01C (R/ )  Program Counter Sample Register           */
	__vo uint32_t COMP0;                   /*!< Offset: 0x020 (R/W)  Comparator Register 0                     */
	__vo uint32_t MASK0;                   /*!< Offset: 0x024 (R/W)  Mask Register 0                           */
	__vo uint32_t FUNCTION0;               /*!< Offset: 0x028 (R/W)  Function Register 0                       */
       uint32_t RESERVED0[1];
       __vo uint32_t COMP1;                   /*!< Offset: 0x030 (R/W)  Comparator Register 1                     */
       __vo uint32_t MASK1;                   /*!< Offset: 0x034 (R/W)  Mask Register 1                           */
       __vo uint32_t FUNCTION1;               /*!< Offset: 0x038 (R/W)  Function Register 1                       */
       uint32_t RESERVED1[1];
       __vo uint32_t COMP2;                   /*!< Offset: 0x040 (R/W)  Comparator Register 2                     */
       __vo uint32_t MASK2;                   /*!< Offset: 0x044 (R/W)  Mask Register 2                           */
       __vo uint32_t FUNCTION2;               /*!< Offset: 0x048 (R/W)  Function Register 2                       */
       uint32_t RESERVED2[1];
       __vo uint32_t COMP3;                   /*!< Offset: 0x050 (R/W)  Comparator Register 3                     */
       __vo uint32_t MASK3;                   /*!< Offset: 0x054 (R/W)  Mask Register 3                           */
       __vo uint32_t FUNCTION3;               /*!< Offset: 0x058 (R/W)  Function Register 3                       */
} DWT_Type;

/*
 * GPIO REGISTERS
 */
typedef struct
{
	__vo uint32_t	MODER ;			/*GPIO port mode register*/ 				/*Address offset 0x00*/
	__vo uint32_t 	OTYPER;				/*GPIO port output type register*/			/*Address offset 0x04*/
	__vo uint32_t 	OSPEEDER;			/*GPIO output Speed*/											/*Address offset 0x08*/
	__vo uint32_t	PUPDR;				/*GPIO port pull-up/pull-down register */	/*Address offset 0x0C*/
	__vo uint32_t	IDR;				/*GPIO port input data register*/			/*Address offset 0x10*/
	__vo uint32_t	ODR ;				/*GPIO port output data register */			/*Address offset 0x14*/
	__vo uint32_t	BSRR;				/*GPIO port bit set/reset register*/		/*Address offset 0x18*/
	__vo uint32_t	LCKR;				/*GPIO port configuration lock register*/	/*Address offset 0x1C*/
	__vo uint32_t	AFR[2];				/*AFR[0]:alternate function low register  AFR[1]:alternate function HIGH register*/


}GPIO_RegDef_t;



/*
 *  GENERAL PURPOSE TIMERS REGISTERS
 */

typedef struct
{
	__vo uint32_t CR1 ;                                        //TIMx control register 1
	__vo uint32_t CR2 ;                                         //TIMx control register 2
	__vo uint32_t SMCR ;                                       //TIMx slave mode control register
	__vo uint32_t DIER ;                                        // TIMx DMA/Interrupt enable register
	__vo uint32_t SR ;                                           //TIMx status register
	__vo uint32_t EGR ;                                              //TIMx event generation register
	__vo uint32_t CCMR1 ;                                                // TIMx capture/compare mode register 1
	__vo uint32_t CCMR2 ;                                                   //TIMx capture/compare mode register 2
	__vo uint32_t CCER ;                                             //TIMx capture/compare enable register
	__vo uint32_t CNT ;                                              //TIMx counter
	__vo uint32_t PSC ;                                               //TIMx prescaler
	__vo uint32_t ARR ;                                              //TIMx auto-reload register
	__vo uint32_t RESERVED1 ;
	__vo uint32_t  CCR1 ;                                              //TIMx capture/compare register 1
	__vo uint32_t  CCR2 ;                                                //TIMx capture/compare register 2
	__vo uint32_t CCR3 ;                                                //TIMx capture/compare register 3
	__vo uint32_t CCR4 ;                                               //TIMx capture/compare register 4
	__vo uint32_t RESERVED2 ;
	__vo uint32_t DCR ;                                                 //TIMx DMA control register
	__vo uint32_t DMAR ;                                                //TIMx DMA address for full transfer
	__vo uint32_t OR ;                                                 //TIM2 option register


}TIM_RegDef_t;

   // TIM_RegDef_t *pTIM2 = ((TIM_RegDef_t*) TIM2_BASEADDR)   or      TIM_RegDef_t *pTIM2 =TIM2


