MazenFayed/Multi-Tasking-Management-using-RTOS-in-OBC-of-the-CubeSat-/drivers/inc/stm32f446xx_driver.h
/*
 *  ANALOG TO DIGITAL CONVERTER REGISTERS FOR EACH ADC
 */

typedef struct
{
	__vo uint32_t ADC_SR ;                                                //ADC status register
	__vo uint32_t ADC_CR1 ;                                                //ADC control register 1
	__vo uint32_t  ADC_CR2 ;                                                //ADC control register 2
	__vo uint32_t ADC_SMPR1 ;                                               //ADC sample time register 1
	__vo uint32_t ADC_SMPR2 ;                                               //ADC sample time register 2
	__vo uint32_t ADC_JOFR1 ;                                               //ADC injected channel data offset register 1
	__vo uint32_t ADC_JOFR2 ;                                               //ADC injected channel data offset register 2
	__vo uint32_t ADC_JOFR3 ;                                                //ADC injected channel data offset register 3
	__vo uint32_t ADC_JOFR4 ;                                                  // ADC injected channel data offset register 4
	__vo uint32_t ADC_HTR ;                                                       //ADC watchdog higher threshold register
	__vo uint32_t ADC_LTR ;                                                     // ADC watchdog lower threshold register
	__vo uint32_t ADC_SQR1 ;                                                      //ADC regular sequence register 1
	__vo uint32_t ADC_SQR2 ;                                                            //ADC regular sequence register 2
	__vo uint32_t ADC_SQR3 ;                                                           //ADC regular sequence register 3
	__vo uint32_t ADC_JSQR ;                                                        //ADC injected sequence register
	__vo uint32_t ADC_JDR1 ;                                                       //ADC injected data register 1
	__vo uint32_t ADC_JDR2 ;                                                            //ADC injected data register 2
	__vo uint32_t ADC_JDR3 ;                                                           // ADC injected data register 3
	__vo uint32_t ADC_JDR4 ;                                                          // ADC injected data register 4
	__vo uint32_t ADC_DR ;                                                            //ADC regular data register



}ADC_RegDef_t;


/*
 *  ANALOG TO DIGITAL CONVERTER COMMON RGISTERS FOR ALL ADC
 */

typedef struct
{
	    __vo uint32_t ADC_CSR ;                                                          //ADC Common status register
		__vo uint32_t  ADC_CCR ;                                                         //ADC common control register
		__vo uint32_t  ADC_CDR ;                                                         //ADC common regular data register for dual and triple modes
}ADC_CM_RegDef_t;


/*
 *
 * DIGITAL TO ANALOG CONVERTER REGISTERS
 * */

typedef struct
{

	__vo uint32_t   DAC_CR;                                                          //DAC control register
	__vo uint32_t   DAC_SWTRIGR ;                                                    //DAC software trigger register
	__vo uint32_t   DAC_DHR12R1 ;                                                    //DAC channel1 12-bit right-aligned data holding register
	__vo uint32_t   DAC_DHR12L1 ;                                                     //DAC channel1 12-bit left aligned data holding register
	__vo uint32_t   DAC_DHR8R1 ;                                                      //DAC channel1 8-bit right aligned data holding register
	__vo uint32_t   DAC_DHR12R2 ;                                                     //DAC channel2 12-bit right aligned data holding register
	__vo uint32_t   DAC_DHR12L2 ;                                                        //DAC channel2 12-bit left aligned data holding register
	__vo uint32_t   DAC_DHR8R2 ;                                                       //DAC channel2 8-bit right-aligned data holding register
	__vo uint32_t   DAC_DHR12RD ;                                                      //Dual DAC 12-bit right-aligned data holding register
	__vo uint32_t   DAC_DHR12LD ;                                                       //DUAL DAC 12-bit left aligned data holding register
	__vo uint32_t   DAC_DHR8RD ;                                                       //DUAL DAC 8-bit right aligned data holding register
	__vo uint32_t   DAC_DOR1 ;                                                          //DAC channel1 data output register 1
	__vo uint32_t   DAC_DOR2 ;                                                          //DAC channel1 data output register 2
	__vo uint32_t   DAC_SR ;                                                             //DAC status register


}DAC_RegDef_t;



/*
 * RCC REGISTERS
 */
typedef struct
{
	__vo uint32_t	CR;																/*Address offset 0x00*/
	__vo uint32_t	PLL_CFGR;														/*Address offset 0x04*/
	__vo uint32_t	CFGR;															/*Address offset 0x08*/
	__vo uint32_t	CIR;															/*Address offset 0x0C*/
	__vo uint32_t	AHB1_RSTR;														/*Address offset 0x10*/
	__vo uint32_t	AHB2_RSTR;														/*Address offset 0x14*/
	__vo uint32_t	AHB3_RSTR;														/*Address offset 0x18*/
	__vo uint32_t	Reserved0;														/*Address offset 0x1C*/
	__vo uint32_t	APB1_RSTR;														/*Address offset 0x20*/
	__vo uint32_t	APB2_RSTR;														/*Address offset 0x24*/
	__vo uint32_t	Reserved1[2];													/*Address offset 0x28  0x2C*/
	__vo uint32_t	AHB1ENR;														/*Address offset 0x30*/
	__vo uint32_t	AHB2ENR;														/*Address offset 0x34*/
	__vo uint32_t	AHB3ENR;														/*Address offset 0x38*/
	__vo uint32_t	Reserved2;														/*Address offset 0x3C*/
	__vo uint32_t	APB1ENR;														/*Address offset 0x40*/
	__vo uint32_t	APB2ENR;														/*Address offset 0x44*/
	__vo uint32_t	Reserved3[2];													/*Address offset 0x48 , 0x4C*/
	__vo uint32_t	AHB1_LPENR;														/*Address offset 0x50*/
	__vo uint32_t	AHB2_LPENR;														/*Address offset 0x54*/
	__vo uint32_t	AHB3_LPENR;														/*Address offset 0x58*/
	__vo uint32_t	Reserved4;														/*Address offset 0x5C*/
	__vo uint32_t	APB1_LPENR;														/*Address offset 0x60*/
	__vo uint32_t	APB2_LPENR;														/*Address offset 0x64*/
	__vo uint32_t	Reserved5[2];													/*Address offset 0x68 , 0x6C*/
	__vo uint32_t	BDCR;															/*Address offset 0x70*/
	__vo uint32_t	CSR;															/*Address offset 0x74*/
	__vo uint32_t	Reserved6[2];													/*Address offset 0x78 , 0x7C*/
	__vo uint32_t	SS_CGR;															/*Address offset 0x80*/
	__vo uint32_t	PLLI2_SCFGR;													/*Address offset 0x84*/
	__vo uint32_t	PLL_SAI_CFGR;													/*Address offset 0x88*/
	__vo uint32_t	DCK_CFGR;														/*Address offset 0x8C*/
	__vo uint32_t	CK_GATENR;														/*Address offset 0x90*/
	__vo uint32_t	DCK_CFGR2;														/*Address offset 0x94*/


}RCC_RegDef_t;
