MazenFayed/Multi-Tasking-Management-using-RTOS-in-OBC-of-the-CubeSat-/drivers/inc/stm32f446xx_driver.h
//GPIO_RegDef_t *pGPIOA =GPIOA_BASEADDR ; /* a pointer to the base address of GPIOA; hence we can access any register from that base by just
 	 	 	 	 	 	 	 	 	 	 	 /*	typing pGPIOA->REG_NAME ==GPIOA_BASEADDR+REG_NAME*/


/*
 * peripheral register definition structure for EXTI
 */
typedef struct
{
	__vo uint32_t IMR;    /*!< Interrupt mask register          	  	    Address offset: 0x00 */
	__vo uint32_t EMR;    /*!< Event mask register							Address offset: 0x04 */
	__vo uint32_t RTSR;   /*!<Rising trigger selection register             Address offset: 0x08 */
	__vo uint32_t FTSR;   /*!< Falling trigger selection register			Address offset: 0x0C */
	__vo uint32_t SWIER;  /*!<Software interrupt event register  			Address offset: 0x10 */
	__vo uint32_t PR;     /*!< Pending register                			    Address offset: 0x14 */

}EXTI_RegDef_t;


/*
 * peripheral register definition structure for SPI
 */
typedef struct
{
	__vo uint32_t CR1;        /*!< TODO,     										Address offset: 0x00 */
	__vo uint32_t CR2;        /*!< TODO,     										Address offset: 0x04 */
	__vo uint32_t SR;         /*!< TODO,     										Address offset: 0x08 */
	__vo uint32_t DR;         /*!< TODO,     										Address offset: 0x0C */
	__vo uint32_t CRCPR;      /*!< TODO,     										Address offset: 0x10 */
	__vo uint32_t RXCRCR;     /*!< TODO,     										Address offset: 0x14 */
	__vo uint32_t TXCRCR;     /*!< TODO,     										Address offset: 0x18 */
	__vo uint32_t I2SCFGR;    /*!< TODO,     										Address offset: 0x1C */
	__vo uint32_t I2SPR;      /*!< TODO,     										Address offset: 0x20 */
} SPI_RegDef_t;


/*
 * peripheral register definition structure for SYSCFG
 */
typedef struct
{
	__vo uint32_t MEMRMP;       /*!< Give a short description,                    Address offset: 0x00      */
	__vo uint32_t PMC;          /*!< TODO,     									  Address offset: 0x04      */
	__vo uint32_t EXTICR[4];    /*!< TODO , 									  Address offset: 0x08-0x14 */
	uint32_t      RESERVED1[2];  /*!< TODO          							  Reserved, 0x18-0x1C    	*/
	__vo uint32_t CMPCR;        /*!< TODO         								  Address offset: 0x20      */
	uint32_t      RESERVED2[2];  /*!<                                             Reserved, 0x24-0x28 	    */
	__vo uint32_t CFGR;         /*!< TODO                                         Address offset: 0x2C   	*/
} SYSCFG_RegDef_t;



/*
 * peripheral register definition structure for I2C
 */
typedef struct
{
  __vo uint32_t CR1;        /*!< TODO,     										Address offset: 0x00 */
  __vo uint32_t CR2;        /*!< TODO,     										Address offset: 0x04 */
  __vo uint32_t OAR1;       /*!< TODO,     										Address offset: 0x08 */
  __vo uint32_t OAR2;       /*!< TODO,     										Address offset: 0x0C */
  __vo uint32_t DR;         /*!< TODO,     										Address offset: 0x10 */
  __vo uint32_t SR1;        /*!< TODO,     										Address offset: 0x14 */
  __vo uint32_t SR2;        /*!< TODO,     										Address offset: 0x18 */
  __vo uint32_t CCR;        /*!< TODO,     										Address offset: 0x1C */
  __vo uint32_t TRISE;      /*!< TODO,     										Address offset: 0x20 */
  __vo uint32_t FLTR;       /*!< TODO,     										Address offset: 0x24 */
}I2C_RegDef_t;

/*
 * peripheral register definition structure for USART
 */
typedef struct
{
	__vo uint32_t SR;         /*!< TODO,     										Address offset: 0x00 */
	__vo uint32_t DR;         /*!< TODO,     										Address offset: 0x04 */
	__vo uint32_t BRR;        /*!< TODO,     										Address offset: 0x08 */
	__vo uint32_t CR1;        /*!< TODO,     										Address offset: 0x0C */
	__vo uint32_t CR2;        /*!< TODO,     										Address offset: 0x10 */
	__vo uint32_t CR3;        /*!< TODO,     										Address offset: 0x14 */
	__vo uint32_t GTPR;       /*!< TODO,     										Address offset: 0x18 */
} USART_RegDef_t;


/*
 * peripheral definition (peripheral base addresses type casted to xxx_RegDef_t
 */



#define GPIOA								((GPIO_RegDef_t*) GPIOA_BASEADDR)
#define GPIOB 							   	((GPIO_RegDef_t*) GPIOB_BASEADDR)
#define GPIOC								((GPIO_RegDef_t*) GPIOC_BASEADDR)
#define GPIOD								((GPIO_RegDef_t*) GPIOD_BASEADDR)
#define GPIOE 								((GPIO_RegDef_t*) GPIOE_BASEADDR)
#define GPIOF 								((GPIO_RegDef_t*) GPIOF_BASEADDR)
#define GPIOG 								((GPIO_RegDef_t*) GPIOG_BASEADDR)
#define GPIOH 								((GPIO_RegDef_t*) GPIOH_BASEADDR)

#define RCC 								((RCC_RegDef_t*) RCC_BASEADDR)
#define EXTI								((EXTI_RegDef_t*)EXTI_BASEADDR)
#define SYSCFG								((SYSCFG_RegDef_t*)SYSCFG_BASEADDR)

#define SPI1  								((SPI_RegDef_t*)SPI1_BASEADDR)
#define SPI2  								((SPI_RegDef_t*)SPI2_BASEADDR)
#define SPI3  								((SPI_RegDef_t*)SPI3_BASEADDR)
#define SPI4  								((SPI_RegDef_t*)SPI4_BASEADDR)

#define I2C1  								((I2C_RegDef_t*)I2C1_BASEADDR)
#define I2C2  								((I2C_RegDef_t*)I2C2_BASEADDR)
#define I2C3  								((I2C_RegDef_t*)I2C3_BASEADDR)

#define USART1  							((USART_RegDef_t*)USART1_BASEADDR)
#define USART2  							((USART_RegDef_t*)USART2_BASEADDR)
#define USART3  							((USART_RegDef_t*)USART3_BASEADDR)
#define UART4  								((USART_RegDef_t*)UART4_BASEADDR)
#define UART5  								((USART_RegDef_t*)UART5_BASEADDR)
#define USART6  							((USART_RegDef_t*)USART6_BASEADDR)



#define TIM2                             ((TIM_RegDef_t*) TIM2_BASEADDR)
#define TIM3                              ((TIM_RegDef_t*) TIM2_BASEADDR)
#define TIM4                              ((TIM_RegDef_t*) TIM2_BASEADDR)
#define TIM5                              ((TIM_RegDef_t*) TIM2_BASEADDR)
#define TIM6                             ((TIM_RegDef_t*) TIM2_BASEADDR)
#define TIM7                              ((TIM_RegDef_t*) TIM2_BASEADDR)
#define TIM12                              ((TIM_RegDef_t*) TIM2_BASEADDR)
#define TIM13                              ((TIM_RegDef_t*) TIM2_BASEADDR)
#define TIM14                              ((TIM_RegDef_t*) TIM2_BASEADDR)



#define ADC1                                  ((ADC_RegDef_t*) ADC1_BASEADDR)
#define ADC2                                  ((ADC_RegDef_t*) ADC2_BASEADDR)
#define ADC3                                  ((ADC_RegDef_t*) ADC3_BASEADDR)
#define ADC_CR                                ((ADC_CM_RegDef_t*) ADC_CR_BASEADDR)

