MazenFayed/Multi-Tasking-Management-using-RTOS-in-OBC-of-the-CubeSat-/drivers/inc/stm32f446xx_driver.h
#define DAC                                   ((DAC_RegDef_t*) DAC_BASEADDR)


#define DWT                 ((DWT_Type       *)     DWT_BASE      )   /*!< DWT configuration struct           */


/*
 * Clock Enable Macros for GPIOx peripherals
 */
#define GPIOA_PCLK_EN()						(RCC->AHB1ENR |=(1<<0))
#define GPIOB_PCLK_EN()						(RCC->AHB1ENR |=(1<<1))
#define GPIOC_PCLK_EN()						(RCC->AHB1ENR |=(1<<2))
#define GPIOD_PCLK_EN()						(RCC->AHB1ENR |=(1<<3))
#define GPIOE_PCLK_EN()						(RCC->AHB1ENR |=(1<<4))
#define GPIOF_PCLK_EN()						(RCC->AHB1ENR |=(1<<5))
#define GPIOG_PCLK_EN()						(RCC->AHB1ENR |=(1<<6))
#define GPIOH_PCLK_EN()						(RCC->AHB1ENR |=(1<<7))


/*
 * Clock Disable Macros for GPIOx peripherals
 */
#define GPIOA_PCLK_DI()						(RCC->AHB1ENR &=~(1<<0))
#define GPIOB_PCLK_DI()						(RCC->AHB1ENR &=~(1<<1))
#define GPIOC_PCLK_DI()						(RCC->AHB1ENR &=~(1<<2))
#define GPIOD_PCLK_DI()						(RCC->AHB1ENR &=~(1<<3))
#define GPIOE_PCLK_DI()						(RCC->AHB1ENR &=~(1<<4))
#define GPIOF_PCLK_DI()						(RCC->AHB1ENR &=~(1<<5))
#define GPIOG_PCLK_DI()						(RCC->AHB1ENR &=~(1<<6))
#define GPIOH_PCLK_DI()						(RCC->AHB1ENR &=~(1<<7))



/*
 * This macro returns a code( between 0 to 7) for a given GPIO base address(x)
 */
#define GPIO_BASEADDR_TO_CODE(x)    		  ( (x == GPIOA)?0:\
												(x == GPIOB)?1:\
												(x == GPIOC)?2:\
												(x == GPIOD)?3:\
												(x == GPIOE)?4:\
												(x == GPIOF)?5:\
												(x == GPIOG)?6:\
												(x == GPIOH)?7:0 )


/*
 * IRQ(Interrupt Request) Numbers of STM32F446xx MCU
 * NOTE: update these macros with valid values according to your MCU
 * From Vector table get position number
 */

#define IRQ_NO_EXTI0 		6
#define IRQ_NO_EXTI1 		7
#define IRQ_NO_EXTI2 		8
#define IRQ_NO_EXTI3 		9
#define IRQ_NO_EXTI4 		10
#define IRQ_NO_EXTI9_5 		23
#define IRQ_NO_EXTI15_10 	40

#define IRQ_NO_SPI1			35
#define IRQ_NO_SPI2         36
#define IRQ_NO_SPI3         51
#define IRQ_NO_SPI4			84

#define IRQ_NO_I2C1_EV      31
#define IRQ_NO_I2C1_ER  	32
#define IRQ_NO_I2C2_EV      33
#define IRQ_NO_I2C2_ER  	34
#define IRQ_NO_I2C3_EV      72
#define IRQ_NO_I2C3_ER  	73

#define IRQ_NO_USART1	    37
#define IRQ_NO_USART2	    38
#define IRQ_NO_USART3	    39
#define IRQ_NO_UART4	    52
#define IRQ_NO_UART5	    53
#define IRQ_NO_USART6	    71


/*
 * Clock Enable Macros for CRC_RST peripherals
 */
#define CRC_RST_PCLK_EN()		(RCC->AHB1ENR |=(1<<12))

/*
 * Clock Disable Macros for CRC_RST peripherals
 */
#define CRC_RST_PCLK_DI()		(RCC->AHB1ENR &=~(1<<12))

/*
 * Clock Enable Macros for DMAx peripherals
 */
#define DMA1_RST_PCLK_EN()		(RCC->AHB1ENR |=(1<<21))
#define DMA2_RST_PCLK_EN()		(RCC->AHB1ENR |=(1<<22))

/*
 * Clock Disable Macros for DMAx peripherals
 */
#define DMA1_RST_PCLK_DI()		(RCC->AHB1ENR &=~(1<<21))
#define DMA2_RST_PCLK_DI()		(RCC->AHB1ENR &=~(1<<22))


/*
 * Clock Enable Macros for OTGHS peripherals
 */
#define OTGHS_RST_PCLK_EN()		(RCC->AHB1ENR |=(1<<29))

/*
 * Clock Disable Macros for OTGHS peripherals
 */
#define OTGHS_RST_PCLK_DI()		(RCC->AHB1ENR &=~(1<<29))



/*
 * Clock Enable Macros for SAIx peripherals
 */
#define SAI1_PCLK_EN()			(RCC->APB2_LPENR |=(1<<22))
#define SAI2_PCLK_EN()			(RCC->APB2_LPENR |=(1<<23))

/*
 * Clock Disable Macros for SAIx peripherals
 */
#define SAI1_PCLK_DI()			(RCC->APB2_LPENR &=~(1<<22))
#define SAI2_PCLK_DI()			(RCC->APB2_LPENR &=~(1<<23))


/*
 * Clock Enable Macros for SDIO peripherals
 */
#define SDIO_PCLK_EN()			(RCC->APB2_LPENR |=(1<<11))

/*
 * Clock Disable Macros for SDIO peripherals
 */
#define SDIO_PCLK_DI()			(RCC->APB2_LPENR &=~(1<<11))


/*
 * Clock Enable Macros for SYSCFG peripherals
 */
#define SYSCFG_PCLK_EN()			(RCC->APB2ENR |=(1<<14))


/*
 * Clock Disable Macros for SYSCFG peripherals
 */
#define SYSCFG_PCLK_DI()			(RCC->APB2ENR &=~(1<<14))


/*
 * Clock Enable Macros for TIMx peripherals
 */
#define TIM1_PCLK_EN()			(RCC->APB2_LPENR |=(1<<0))
#define TIM2_PCLK_EN()			(RCC->APB1_LPENR |=(1<<0))
#define TIM3_PCLK_EN()			(RCC->APB1_LPENR |=(1<<1))
#define TIM4_PCLK_EN()			(RCC->APB1_LPENR |=(1<<2))
#define TIM5_PCLK_EN()			(RCC->APB1_LPENR |=(1<<3))
#define TIM6_PCLK_EN()			(RCC->APB1_LPENR |=(1<<4))
#define TIM7_PCLK_EN()			(RCC->APB1_LPENR |=(1<<5))
#define TIM8_PCLK_EN()			(RCC->APB2_LPENR |=(1<<1))
#define TIM9_PCLK_EN()			(RCC->APB2_LPENR |=(1<<16))
#define TIM10_PCLK_EN()			(RCC->APB2_LPENR |=(1<<17))
#define TIM11_PCLK_EN()			(RCC->APB2_LPENR |=(1<<18))
#define TIM12_PCLK_EN()			(RCC->APB1_LPENR |=(1<<6))
#define TIM13_PCLK_EN()			(RCC->APB1_LPENR |=(1<<7))
#define TIM14_PCLK_EN()			(RCC->APB1_LPENR |=(1<<8))


/*
 * Clock Disable Macros for TIMx peripherals
 */
#define TIM1_PCLK_DI()			(RCC->APB2_LPENR &=~(1<<0))
#define TIM2_PCLK_DI()			(RCC->APB1_LPENR &=~(1<<0))
#define TIM3_PCLK_DI()			(RCC->APB1_LPENR &=~(1<<1))
#define TIM4_PCLK_DI()			(RCC->APB1_LPENR &=~(1<<2))
#define TIM5_PCLK_DI()			(RCC->APB1_LPENR &=~(1<<3))
#define TIM6_PCLK_DI()			(RCC->APB1_LPENR &=~(1<<4))
#define TIM7_PCLK_DI()			(RCC->APB1_LPENR &=~(1<<5))
#define TIM8_PCLK_DI()			(RCC->APB2_LPENR &=~(1<<1))
#define TIM9_PCLK_DI()			(RCC->APB2_LPENR &=~(1<<16))
#define TIM10_PCLK_DI()			(RCC->APB2_LPENR &=~(1<<17))
#define TIM11_PCLK_DI()			(RCC->APB2_LPENR &=~(1<<18))
#define TIM12_PCLK_DI()			(RCC->APB1_LPENR &=~(1<<6))
#define TIM13_PCLK_DI()			(RCC->APB1_LPENR &=~(1<<7))
#define TIM14_PCLK_DI()			(RCC->APB1_LPENR &=~(1<<8))



/*
 * Clock Enable Macros for WWDG peripherals
 */
#define WWDG_PCLK_EN()		(RCC->APB1_LPENR |=(1<<11))


/*
 * Clock Disable Macros for WWDG peripherals
 */
#define WWDG_PCLK_DI()		(RCC->APB1_LPENR &=~(1<<11))



/*
 * Clock Enable Macros for SPDIFRX peripherals
 */
#define SPDIFRX_PCLK_EN()		(RCC->APB1_LPENR |=(1<<16))


/*
 * Clock Disable Macros for SPDIFRX peripherals
 */
#define SPDIFRX_PCLK_DI()		(RCC->APB1_LPENR &=~(1<<16))

/*
 * Clock Enable Macros for I2Cx peripherals
 */
#define I2C1_PCLK_EN()			(RCC->APB1ENR |=(1<<21))
#define I2C2_PCLK_EN()			(RCC->APB1ENR |=(1<<22))
#define I2C3_PCLK_EN()			(RCC->APB1ENR |=(1<<23))


