MazenFayed/Multi-Tasking-Management-using-RTOS-in-OBC-of-the-CubeSat-/drivers/inc/stm32f446xx_driver.h
/*
 * Clock Disable Macros for I2Cx peripherals
 */
#define I2C1_PCLK_DI()			(RCC->APB1ENR &=~(1<<21))
#define I2C2_PCLK_DI()			(RCC->APB1ENR &=~(1<<22))
#define I2C3_PCLK_DI()			(RCC->APB1ENR &=~(1<<23))

/*
 * Clock Enable Macros for  FMPI2C1 peripherals
 */
#define FMPI2C1_PCLK_EN()		(RCC->APB1_LPENR |=(1<<24))

/*
 * Clock Disable Macros for  FMPI2C1 peripherals
 */
#define FMPI2C1_PCLK_DI()		(RCC->APB1_LPENR &=~(1<<24))

/*
 * Clock Enable Macros for  CANx peripherals
 */
#define CAN1_PCLK_EN()			(RCC->APB1_LPENR |=(1<<25))
#define CAN2_PCLK_EN()			(RCC->APB1_LPENR |=(1<<26))


/*
 * Clock Disable Macros for  CANx peripherals
 */
#define CAN1_PCLK_DI()			(RCC->APB1_LPENR &=~(1<<25))
#define CAN2_PCLK_DI()			(RCC->APB1_LPENR &=~(1<<26))


/*
 * Clock Enable Macros for  DAC peripherals
 */
#define DAC_PCLK_EN()			(RCC->APB1_LPENR |=(1<<27))

/*
 * Clock Disable Macros for  DAC peripherals
 */
#define DAC_PCLK_DI()			(RCC->APB1_LPENR &=~(1<<27))



/*
 * Clock Enable Macros for  CECLP peripherals
 */
#define CECLP_PCLK_EN()			(RCC->APB1_LPENR |=(1<<28))

/*
 * Clock Disable Macros for  CECLP peripherals
 */
#define CECLP_PCLK_DI()			(RCC->APB1_LPENR &=~(1<<28))



/*
 * Clock Enable Macros for  PWR peripherals
 */
#define PWR_PCLK_EN()			(RCC->APB1_LPENR |=(1<<29))


/*
 * Clock Disable Macros for  PWR peripherals
 */
#define PWR_PCLK_DI()			(RCC->APB1_LPENR &=~(1<<29))




/*
 * Clock Enable Macros for  ADC peripherals
 */
#define ADC1_PCLK_EN()			(RCC->APB2_LPENR |=(1<<8))
#define ADC2_PCLK_EN()			(RCC->APB2_LPENR |=(1<<9))
#define ADC3_PCLK_EN()			(RCC->APB2_LPENR |=(1<<10))


/*
 * Clock Disable Macros for  ADC peripherals
 */
#define ADC1_PCLK_DI()			(RCC->APB2_LPENR &=~(1<<8))
#define ADC2_PCLK_DI()			(RCC->APB2_LPENR &=~(1<<9))
#define ADC3_PCLK_DI()			(RCC->APB2_LPENR &=~(1<<10))




/*
 * Clock Enable Macros for SPIx peripherals
 */
#define SPI1_PCLK_EN()			(RCC->APB2ENR |=(1<<12))
#define SPI2_PCLK_EN()			(RCC->APB1ENR |=(1<<14))
#define SPI3_PCLK_EN()			(RCC->APB1ENR |=(1<<15))
#define SPI4_PCLK_EN()			(RCC->APB2ENR |=(1<<13))

/*
 * Clock Disable Macros for SPIx peripherals
 */
#define SPI1_PCLK_DI()			(RCC->APB2ENR &=~(1<<12))
#define SPI2_PCLK_DI()			(RCC->APB1ENR &=~(1<<14))
#define SPI3_PCLK_DI()			(RCC->APB1ENR &=~(1<<15))
#define SPI4_PCLK_DI()			(RCC->APB2ENR &=~(1<<13))



/*
 *  Macros to reset GPIOx Register
 */
#define GPIOA_REG_RESET()		    do{(RCC->AHB1_RSTR |=(1<<0)); (RCC->AHB1_RSTR &=~(1<<0)); }while(0)
#define GPIOB_REG_RESET()			do{(RCC->AHB1_RSTR |=(1<<1)); (RCC->AHB1_RSTR &=~(1<<1)); }while(0)
#define GPIOC_REG_RESET()			do{(RCC->AHB1_RSTR |=(1<<2)); (RCC->AHB1_RSTR &=~(1<<2)); }while(0)
#define GPIOD_REG_RESET()			do{(RCC->AHB1_RSTR |=(1<<3)); (RCC->AHB1_RSTR &=~(1<<3)); }while(0)
#define GPIOE_REG_RESET()			do{(RCC->AHB1_RSTR |=(1<<4)); (RCC->AHB1_RSTR &=~(1<<4)); }while(0)
#define GPIOF_REG_RESET()			do{(RCC->AHB1_RSTR |=(1<<5)); (RCC->AHB1_RSTR &=~(1<<5)); }while(0)
#define GPIOG_REG_RESET()			do{(RCC->AHB1_RSTR |=(1<<6)); (RCC->AHB1_RSTR &=~(1<<6)); }while(0)
#define GPIOH_REG_RESET()			do{(RCC->AHB1_RSTR |=(1<<7)); (RCC->AHB1_RSTR &=~(1<<7)); }while(0)

/*
 *  Macros to reset SPIx Register
 */
#define SPI1_REG_RESET()		    do{(RCC->APB2_RSTR |=(1<<12)); (RCC->APB2_RSTR &=~(1<<12)); }while(0)
#define SPI2_REG_RESET()			do{(RCC->APB1_RSTR |=(1<<14)); (RCC->APB1_RSTR &=~(1<<14)); }while(0)
#define SPI3_REG_RESET()			do{(RCC->APB1_RSTR |=(1<<15)); (RCC->APB1_RSTR &=~(1<<15)); }while(0)
#define SPI4_REG_RESET()			do{(RCC->APB2_RSTR |=(1<<13)); (RCC->APB2_RSTR &=~(1<<13)); }while(0)



/*
 *  Macros to reset I2Cx Register
 */
#define I2C1_REG_RESET()		    do{(RCC->APB1_RSTR |=(1<<21)); (RCC->APB1_RSTR &=~(1<<21)); }while(0)
#define I2C2_REG_RESET()			do{(RCC->APB1_RSTR |=(1<<22)); (RCC->APB1_RSTR &=~(1<<22)); }while(0)
#define I2C3_REG_RESET()			do{(RCC->APB1_RSTR |=(1<<23)); (RCC->APB1_RSTR &=~(1<<23)); }while(0)


/*
 *  Macros to reset USARTx Register
 */
#define USART2_REG_RESET()		    do{(RCC->APB1_RSTR |=(1<<17)); (RCC->APB1_RSTR &=~(1<<17)); }while(0)
#define USART3_REG_RESET()			do{(RCC->APB1_RSTR |=(1<<18)); (RCC->APB1_RSTR &=~(1<<18)); }while(0)
#define USART4_REG_RESET()			do{(RCC->APB1_RSTR |=(1<<19)); (RCC->APB1_RSTR &=~(1<<19)); }while(0)
#define USART5_REG_RESET()			do{(RCC->APB1_RSTR |=(1<<20)); (RCC->APB1_RSTR &=~(1<<20)); }while(0)



/*
 * Clock Enable Macros for USARTx peripherals
 */
#define USART1_PCLK_EN()		(RCC->APB2_LPENR |=(1<<4))
#define USART2_PCLK_EN()		(RCC->APB1_LPENR |=(1<<17))
#define USART3_PCLK_EN()		(RCC->APB1_LPENR |=(1<<18))
#define USART6_PCLK_EN()		(RCC->APB2_LPENR |=(1<<5))


/*
 * Clock Disable Macros for USARTx peripherals
 */
#define USART1_PCLK_DI()		(RCC->APB2_LPENR &=~(1<<4))
#define USART2_PCLK_DI()		(RCC->APB1_LPENR &=~(1<<17))
#define USART3_PCLK_DI()		(RCC->APB1_LPENR &=~(1<<18))
#define USART6_PCLK_DI()		(RCC->APB2_LPENR &=~(1<<5))

/*
 * Clock Enable Macros for UARTx peripherals
 */
#define UART4_PCLK_EN()			(RCC->APB1_LPENR |=(1<<19))
#define UART5_PCLK_EN()			(RCC->APB1_LPENR |=(1<<20))


/*
 * Clock Disable Macros for UARTx peripherals
 */
#define UART4_PCLK_DI()			(RCC->APB1_LPENR &=~(1<<19))
#define UART5_PCLK_DI()			(RCC->APB1_LPENR &=~(1<<20))


/*
 * Some macros
 */
#define Enable			 	1
#define Disable				0
#define set 				Enable
#define Reset				Disable
#define GPIO_PIN_SET		set
#define GPIO_PIN_RESET		Reset
#define FLAG_RESET     	    Reset
#define FLAG_SET 			set


/******************************************************************************************
 *Bit position definitions of SPI peripheral
 ******************************************************************************************/
/*
 * Bit position definitions SPI_CR1
 */
#define SPI_CR1_CPHA     				 0
#define SPI_CR1_CPOL      				 1
#define SPI_CR1_MSTR     				 2
#define SPI_CR1_BR   					 3
#define SPI_CR1_SPE     				 6
#define SPI_CR1_LSBFIRST   			 	 7
#define SPI_CR1_SSI     				 8
#define SPI_CR1_SSM      				 9
#define SPI_CR1_RXONLY      		 	10
#define SPI_CR1_DFF     			 	11
#define SPI_CR1_CRCNEXT   			 	12
#define SPI_CR1_CRCEN   			 	13
#define SPI_CR1_BIDIOE     			 	14
#define SPI_CR1_BIDIMODE      			15

